HADIS = [
    {
        "title": "1. Глава 1: О том, как начали ниспосылаться откровения",
        "text": """Глава 1: О том, как начали ниспосылаться откровения Посланнику Аллаха ﷺ

Шейх, имам, хафиз Абу 'Абдуллах Мухаммад ибн Исма'иль ибн Ибрахим аль-Мугъира аль-Бухари, да помилует его Аллах, сказал:

О том, как начали ниспосылаться откровения Посланнику Аллаха ﷺ, и о словах Аллаха, да возвысится поминание Его: «Воистину, Мы внушили тебе откровение, подобно тому, как внушили его Нуху и пророкам после него» (сура «ан-Ниса», аят 163).

1 — Сообщается от 'Умара ибн аль-Хаттаба, да будет доволен им Аллах, как он, будучи на минбаре, сказал:

— Я слышал, как Посланник Аллаха ﷺ сказал: «Поистине, дела (оцениваются) только по намерениям и, поистине, каждому человеку (достанется) лишь то, что он намеревался (обрести), и (поэтому) переселявшийся[1] ради чего-нибудь мирского или ради женщины, на которой он хотел жениться[2], переселится (лишь) к тому, к чему он переселялся[3]».
""",
    },
    {
        "title": "2. Глава 2",
        "text": """2. Глава
2 — Нам рассказал 'Абдулла ибн Юсуф, сказавший: Нам сообщил Малик, от Хишама ибн 'Урвы, от его отца, от 'Аиши — матери правоверных, да будет доволен ею Аллах, о том, что (однажды) аль-Харис ибн Хишам, да будет доволен им Аллах, спросил Посланника Аллаха ﷺ: «О Посланник Аллаха, как приходят к тебе откровения?» Посланник Аллаха ﷺ ответил: «Иногда приходящее ко мне подобно звону колокола, что является для меня наиболее тяжким, и это покидает меня, когда я уже усвоил сказанное им. Иногда же ангел предстаёт передо мной в образе человека и обращается ко мне со своими словами, и я усваиваю то, что он говорит». 'Аиша, да будет доволен ею Аллах, сказала: «И мне приходилось видеть, как в очень холодные дни ему ниспосылались откровения, а после завершения (ниспослания) со лба его лился пот».
""",
    },
    {
        "title": "3. Глава: вещие сны — часть откровения",
        "text": """3. Глава: вещие сны — часть откровения
3 — Нам рассказал Яхйа ибн Букайр, сказавший: Нам рассказал Аль-Лейс от 'Укайла, от ибн Шихаба от 'Урвы ибн аз-Зубейра, от 'Аиши матери правоверных то, что она сказала: «Ниспослание откровений Посланнику Аллаха ﷺ началось с благого видения во сне, а никаких иных видений, кроме приходивших подобно утренней заре, он никогда не видел. Затем ему была внушена любовь к уединению, и он стал часто уединяться в пещере на горе Хира, где занимался делами благочестия, что выражалось в поклонении (Аллаху) в течение многих ночей, пока у него не возникало желание вернуться к семье. Обычно он брал с собой все необходимые для этого припасы, а потом возвращался к Хадидже и брал всё, что ему было нужно, для нового такого же уединения. (Это продолжалось до тех пор.) пока ему не открылась истина, когда он находился в пещере (на горе) Хира. К нему явился ангел и велел: "Читай!" − на что он ответил: "Я не умею читать!"»

(Пророк ﷺ) сказал: «Тогда он взял меня и сжал так, что я напрягся до предела, а затем он отпустил меня и снова велел: "Читай!" Я сказал: "Я не умею читать!" Он во второй раз сжал меня так, что я (опять) напрягся до предела, а затем отпустил и велел: "Читай!" — и я (снова) сказал: "Я не умею читать!" Тогда он сжал меня в третий раз, а затем отпустил и сказал: "Читай во имя Господа твоего, Который сотворил, сотворил человека из сгустка! Читай, а Господь твой — щедрейший..."»

('Аиша, да будет доволен ею Аллах, сказала): «И Посланник Аллаха ﷺ, сердце которого трепетало от страха, вернулся с этим, вошёл к Хадидже бинт Хувайлид, да будет доволен ею Аллах, и сказал: "Укройте меня, укройте меня!" Его укрыли, (и он оставался в подобном положении,) пока страх его не прошёл, после чего он сообщил ей обо всём (и сказал): "Я испугался за себя!" Хадиджа сказала: "Нет, нет! Клянусь Аллахом, Аллах никогда не покроет тебя позором, ведь ты поддерживаешь связи с родственниками, помогаешь нести бремя (слабому) и оделяешь неимущего, оказываешь людям гостеприимство и помогаешь (им) переносить невзгоды судьбы!" А после этого Хадиджа вышла из дома вместе с ним и привела его к своему двоюродному брату Варакъе ибн Науфалю ибн Асаду ибн 'Абд аль-'Уззе, который в эпоху джахилийи принял христианство, пользовался для своих записей письменностью иудеев, выписывал из Евангелия то, что было угодно Аллаху, и (к тому времени) являлся уже глубоким слепым старцем. Хадиджа сказала ему: "О сын моего дяди, выслушай своего племянника!" Варака спросил его: "О племянник, что ты видишь?" — и Посланник Аллаха ﷺ сообщил ему о том, что он видел. Варака сказал: "Это тот же ангел, которого Аллах направил к Мусе! О, если бы я был молод (в эти дни) и мог дожить до того времени, когда народ твой станет изгонять тебя!" Посланник Аллаха ﷺ спросил: "А разве они будут изгонять меня?" Варака ответил: "Да, ибо когда бы ни являлся человек с чем-либо подобным тому, что принёс с собой ты, с ним всегда враждовали, но если я доживу до этого дня, то буду помогать тебе как только смогу!" Однако Варака вскоре умер, а откровения временно прекратились».
""",
    },
    {
        "title": "4. О периоде временного прекращения откровений",
        "text": """4 — Ибн Шихаб сказал: Рассказал мне Абу Саляма ибн 'Абдуррахман то, что Джабир ибн 'Абдуллах аль-Ансари, рассказывавший о периоде (временного) прекращения откровений, среди прочего сказал:

— (Посланник Аллаха ﷺ сказал: «(Как-то раз) я шёл (по дороге) и вдруг услышал голос с неба. Я поднял голову и увидел явившегося ко мне (в пещеру на горе) Хира ангела, который (на этот раз) сидел на троне между небом и землёй. Я испугался его, вернулся (домой) и сказал: "Укройте меня, укройте меня!" − после чего Аллах Всевышний ниспослал (айаты, в которых говорилось): "О завернувшийся! Встань и увещевай, и Господа своего возвеличивай, и одежды свои очисть, и скверны избегай..."». А после этого откровения возобновились с новой силой и стали приходить одно за другим.
""",
    },
    {
        "title": "Глава 4:",
        "text": """4. Глава
5 — Сообщается от Ибн ‘Аббаса, толкуя слова Всевышнего «Не шевели языком своим, (повторяя его.) чтобы ускорить это...», он сказал: «Посланник Аллаха ﷺ всегда испытывал напряжение во время ниспослания (откровений), что заставляло его шевелить губами». Ибн ‘Аббас сказал: «И я пошевелю губами так же, как делал это Посланник Аллаха ﷺ».

(Ибн ‘Аббас сказал): «И Аллах Всевышний ниспослал (аяты, в которых говорилось): “Не шевели языком своим, (повторяя его,) чтобы ускорить это! Поистине, это Нам надлежит собрать и прочесть его”». Ибн ‘Аббас сказал: «(Это значит:) собрать его для тебя в твоём сердце так, чтобы ты смог читать его».

(Что же касается слов) Аллаха Всевышнего «А когда Мы прочитаем его, следуй его чтению», то Ибн ‘Аббас сказал: «(Это значит:) слушай его внимательно».

Аллах Всевышний сказал: «Далее, поистине, надлежит Нам разъяснить его». (Ибн ‘Аббас сказал: «Это значит:) далее, надлежит Нам сделать так, чтобы ты читал его. И после этого Посланник Аллаха ﷺ всегда выслушивал Джибриля, когда тот являлся к нему, а после того как Джибриль уходил, Пророк ﷺ читал (аяты Корана) так же, как  читал их он""",
    },
    {
        "title": " Глава 5 :",
        "text": """6 — Сообщается от ‘Убейдуллаха ибн ‘Абдуллаха, что Ибн ‘Аббаса сказал:

— Посланник Аллаха ﷺ был щедрейшим из людей, а наибольшую щедрость проявлял он в рамадане, когда с ним встречался Джибрил, и он встречался с ним каждую ночь рамадана, обучая его Корану, и, поистине, по этой причине Посланник Аллаха ﷺ был более щедрым на всё благое, чем вольный ветер.""",
    },
    {
        "title": " Глава 6 :",
        "text": """7 — Нам рассказал Абу аль-Ямаан Аль-Хакам ибн Нафи‘, сказавший: Нам сообщил Шу‘айб, от Аз-Зухри, сказавший: Мне сообщил ‘Убейдуллах ибн ‘Абдуллах ибн ‘Утба ибн Мас‘уд, о том, что ‘Абдуллах бин ‘Аббас, рассказывал ему о том, что Абу Суфйан бин Харб, сообщил ему о том, что Ираклий послал за ним, когда он сопровождал караван курайшитов. Они занимались торговыми делами в Шаме, и это было в то время, когда Посланник Аллаха ﷺ заключил перемирие с Абу Суфйаном и (другими) неверными курайшитами. (Абу Суфйан вместе со своими товарищами) прибыл к императору в Илийу, где Ираклий, находившийся в окружении знатных людей Рума, призвал их ко двору. Подозвав к себе их и своего толмача, он спросил: «Кто из вас приходится самым близким родственником человеку, утверждающему, что он — пророк?»

Абу Cуфйан сказал:

— Я ответил: «Самым близким из них к нему являюсь я». Тогда он сказал: «Подведите его поближе ко мне, а его товарищей поставьте у него за спиной», и велел своему толмачу: «Скажи им, что я буду спрашивать его о том человеке, и, если он солжёт мне, пусть они уличат его во лжи». И, клянусь Аллахом, если бы я не стыдился того, что потом они станут рассказывать о моей лжи, то обязательно сказал бы о нём неправду! Затем (Ираклий) задал мне о нём первый вопрос: «Каково его происхождение (и место) среди вас?» Я ответил: «Он благородного происхождения». Он спросил: «Заявлял ли кто-нибудь из вас нечто подобное раньше?» Я ответил: «Нет». Он спросил: «Был ли кто-нибудь из его предков правителем?» Я ответил: «Нет». Он спросил: «А кто следует за ним, знатные люди или простые?» Я ответил: «Скорее простые». Он спросил: «Число их увеличивается или уменьшается?» Я ответил: «Увеличивается». Он спросил: «А отступает ли кто-нибудь из принявших его религию из-за недовольства ею?» Я ответил: «Нет». Он спросил: «Приходилось ли вам обвинять его во лжи до того, как он заявил об этом?» Я ответил: «Нет». Он спросил: «Не свойственно ли ему вероломство?» Я ответил: «Нет, но у нас с ним сейчас перемирие, и мы не знаем, что он будет делать», и больше ничего не смог добавить к сказанному. Он спросил: «Приходилось ли вам сражаться с ним?» Я ответил: «Да». Он спросил: «И чем же заканчивались ваши сражения?» Я ответил: «Война между нами шла с переменным успехом: он побеждал нас и мы побеждали его». Он спросил: «Что он велит вам делать?» Я ответил: «Он говорит: “Поклоняйтесь одному лишь Аллаху, не поклоняйтесь больше никому наряду с Ним и отрекитесь от того, что говорили ваши предки”, и ещё он велит нам молиться, говорить правду, быть добродетельными и поддерживать связи с родственниками». Тогда он велел толмачу сказать мне: «Я спросил тебя о его происхождении, и ты ответил, что он принадлежит к знатному роду, но и все (прежние) посланники принадлежали к знатным родам своих народов. И я спросил тебя, не говорил ли кто-нибудь из вас подобного до него, ты же ответил, что нет, и я подумал, что если бы кто-нибудь уже заявлял об этом до него, то я решил бы, что этот человек просто повторяет сказанное до него кем-то. Ещё я спросил тебя, был ли кто-нибудь из его предков правителем. Ты ответил, что нет, и я подумал, что если бы он являлся потомком владык, то я решил бы, что этот человек стремится вернуть себе свои родовые владения. Ещё я спросил тебя, не приходилось ли вам обвинять его во лжи, прежде чем он стал говорить то, что говорит, а ты ответил, что нет, и мне стало ясно, что если он не клеветал на людей, то не станет возводить ложь и на Аллаха. Ещё я спросил тебя, знатные люди последовали за ним или простые, и ты сказал, что простые, но именно они и становятся последователями посланников. Ещё я спросил тебя, увеличивается их число или уменьшается, и ты сказал, что увеличивается, но именно таким и должно быть положение веры, пока оно не достигнет совершенства. Ещё я спросил тебя, отступается ли от его религии кто-нибудь из принявших её из-за недовольства ею, и ты ответил, что нет, но (так и бывает), когда (истинная) вера проникает в сердца. Ещё я спросил тебя, не свойственно ли ему вероломство, и ты ответил, что нет, но и посланники никогда не поступают вероломно. Ещё я спросил тебя о том, что он велит вам делать, и ты ответил, что он велит вам поклоняться Аллаху и не поклоняться никому больше наряду с Ним, и запрещает вам поклоняться идолам, и велит вам молиться, говорить правду и быть добродетельными, и если ты говоришь правду, это значит, что он обязательно овладеет тем, что ныне принадлежит мне. Я знал, что он должен появиться, но не предполагал, что он окажется одним из вас. Если бы я был уверен, что сумею добраться до него, то обязательно постарался бы встретиться с ним, а если бы встретился, то непременно омыл бы ему ноги!»

А потом он потребовал подать себе послание Посланника Аллаха ﷺ с которым Дихйа был направлен к наместнику Бусры, и тот подал его Ираклию, который прочитал там следующее:

— C именем Аллаха Милостивого, Милосердного.
От Мухаммада, раба Аллаха и Его посланника, Ираклию, владыке Рума.
Мир тому, кто следует правильным путём.
А затем, поистине, я призываю тебя к Исламу! Прими Ислам, и ты спасёшься, а Аллах удвоит твою награду; если же ты откажешься, тогда на тебя будет возложено бремя греха (твоих) крестьян! И (я скажу тебе то, что сказал Аллах): «Скажи: “О обладатели Писания! Давайте признаем слово, одинаковое для нас и для вас, что не должны мы поклоняться никому, кроме Аллаха, и что ничего не должны мы придавать Ему в сотоварищи, и что никто из нас не будет считать другого Господом наряду с Аллахом”. А если они откажутся, то скажите: “Засвидетельствуйте, что мы — предавшиеся”».
Абу Суфйан сказал: «Когда (Ираклий) закончил читать это послание, сказав то, что сказал, в его собрании стало шумно и поднялся крик, а нас вывели (оттуда), после чего я сказал своим товарищам: “Ибн Абу Кабша стал столь важным человеком, что его боится даже владыка бану-ль-асфар!” С тех пор я был уверен, что он одержит верх, а в конечном итоге Аллах привёл меня к Исламу».

(Передатчик этого хадиса сказал):

«Ибн ан-Натур был наместником Илийи, а Ираклий являлся епископом христиан Шама. (Ибн ан-Натур) сообщает, что однажды, прибыв в Илийу, Ираклий проснулся утром в столь дурном расположении духа, что некоторые из его патрикиев даже сказали ему: “Нам не нравится твой вид!”»

Ибн ан-Натур сказал:

«Ираклий же был прорицателем и астрологом и сказал им в ответ на их вопросы (о причине его дурного настроения): «Наблюдая за звёздами этой ночью, я увидел, что владыка (совершающих) обрезание одержал победу, (и я хочу знать.) кто из людей делает обрезание?» Ему ответили: «Никто, кроме иудеев, но они не должны беспокоить тебя. Направь послания в разные города твоего царства, чтобы там перебили всех иудеев!» Между тем к Ираклию привели человека, которого послал к нему правитель из числа гассанидов, чтобы передать с ним известия о посланнике Аллаха ﷺ. Расспросив гонца, Ираклий велел (своим слугам): «Пойдите и проверьте, обрезан он или нет». Они осмотрели (гонца) и доложили Ираклию, что тот обрезан, и тогда Ираклий стал расспрашивать его об арабах. (Гонец) сказал: «Они (тоже) делают обрезание». (Выслушав его,) Ираклий сказал: «(Теперь) выяснилось, что владычество будет принадлежать им!» А затем Ираклий написал письмо в Румийу своему другу, который обладал такими же познаниями, как и он сам, после чего отправился в Химс и не покидал этого города до тех пор, пока не получил от своего друга ответное послание, в котором тот писал, что разделяет мнение Ираклия о появлении Пророка ﷺ и о том, что (он действительно является) пророком. После этого Ираклий призвал знатных людей Рума явиться в его дворец в Химсе, когда же они собрались, велел запереть ворота. Затем он вышел (к ним) и сказал: «О византийцы! Если вы хотите преуспеть и встать на путь истинный и желаете, чтобы ваше царство устояло, присягните этому пророку!» (Услышав эти слова,) они, подобно диким ослам, бросились к воротам, но обнаружили, что ворота заперты. Поняв, что им ненавистны (его слова) и потеряв надежду на то, что они уверуют, (Ираклий) велел: «Приведите их ко мне!» — (а когда те вернулись), он сказал: «Поистине, я говорил это только для того, чтобы проверить силу вашей приверженности к вашей религии, а теперь я убедился в (этом)!» И тогда они склонились перед (Ираклием) до земли, ибо остались довольны им, и это было последним, что связывало Ираклия (с Исламской религией)».

""",
    },
    {
        "title": "1. Глава о вере и слова Пророка ﷺ: «Ислам основывается на пяти столпах…»",
        "text": """Это слова и дела, и она(вера) увеличивается и уменьшается. Аллах Всевышний сказал: «Чтобы они прибавили веру к своей вере»(Сура «аль-Фатх», 4)
        «и Мы увеличили их приверженность прямому пути»(Сура «аль-Кахф», 13)
        «Аллах увеличивает приверженность прямому пути тех, кто следует прямым путем»(Сура «Марьям», 76)
        «Тем, кто следует прямым путем, Он увеличивает их приверженность прямому пути и дарует их богобоязненность»(Сура «Мухаммад», 17)
        «чтобы усилилась вера у верующих»(Сура «аль-Муддассир», 31).

        А также Его слова: «Что касается тех, кто уверовал, то их вера от этого усиливается, и они радуются»(Сура «ат-Тауба», 124).

        А также Его, да будет возвышено Его поминание, слова: «... “Побойтесь же их”. Однако это лишь приумножило их веру»(Сура «Али ‘Имран», 173).

        А также слова Всевышнего: «Это приумножило в них лишь веру и покорность»(Сура «аль-Ахзаб», 22).

        И также любовь ради Аллаха, и ненависть ради Аллаха из веры.



        ‘Умар ибн ‘Абдуль ‘Азиз написал ‘Адию ибн ‘Ади: «Поистине, у веры есть предписания и религиозные законоположения, границы и Сунны. И тот, кто сделал ее полной, сделал полноценным свой иман, а кто не сделал ее полной, не сделал иман полноценным. Если я буду жив, то разъясню вам это, чтобы вы поступали в соответствии с ним, а если умру, то я и не жаждаю находиться с вами». Ибрахим сказал: «... Но я хочу, чтобы мое сердце успокоилось». Му‘аз сказал: «Садись с нами, поверим часок». Ибн Мас‘уд сказал: «Убеждённость — это вся вера». Ибн ‘Умар сказал: «Не достигнет раб настоящей богобоязненности, пока не оставит то, что чувствует в груди». Муджахид сказал: «Узаконил для вас» —(Означает): «Заповедал тебе и ему о Мухаммад одну религию». Ибн ‘Аббас, да будет доволен Аллах ими обоими, сказал: «Слова “... (свой) закон и путь...” означают: “Сунна и путь”»."""
    },
    {
        "title": "2. Глава: «Ваша мольба – ваша вера»",
        "text": """Слова Всевышнего Аллаха: «Скажи: “Мой Господь не стал бы обращать на вас внимание, если бы не ваши молитвы”». (Сура «Аль-Фуркан»,77), и смысл слова «молитва» в языковом значении — иман.



8 — Нам рассказал ‘Убейдулла ибн Муса, сказавший: Нам сообщил Ханзала ибн Абу Суфйан, от ‘Икримы ибн Халида от Ибн ‘Умара, да будет доволен Аллах ими обоими, сказавшего: сказал: «Посланник Аллаха ﷺ сказал: “Ислам основывается на пяти (столпах): свидетельстве о том, что нет божества, достойного поклонения, кроме Аллаха, и что Мухаммад — Посланник Аллаха, совершении молитвы, выплате закята, совершении хаджа и соблюдении поста в рамадане”»."""
    },
    {
        "title": "3.Глава: Дела веры",
        "text": """И слова Всевышнего Аллаха: «Благочестие состоит не в том, чтобы вы обращали ваши лица на восток и запад. Но благочестив тот, кто уверовал в Аллаха, в Последний день, в ангелов, в Писание, в Пророков, кто раздавал имущество, несмотря на свою любовь к нему, родственникам, сиротам, бедным, путникам и просящим, расходовал его на освобождение рабов, совершал молитву, выплачивал закят, соблюдал договора после их заключения, проявлял терпение в нужде, при болезни и во время сражения. Таковы те, которые правдивы. Таковы богобоязненные» (Сура «аль-Бакъара», 177).

И Его слова: «Воистину, преуспели верующие» (Сура «аль-Муъминун», 1).



9 — Нам рассказал ‘Абдулла ибн Мухаммад аль-Джу‘фий, сказавший: Нам рассказал Абу ‘Аамир аль-‘Акадий, сказавший: Нам рассказал Сулейман ибн Биляль от ‘Абдуллаха ибн Динара, от Абу Салиха, от Абу Хурайры, да будет доволен им Аллах, о том, что Пророк ﷺ сказал:

«Вера (включает в себя) более шестидесяти ответвлений, а стыдливость — (одно из) ответвлений веры».

"""
    },
    {
        "title": " 4. Глава: Мусульманином является тот, от языка и рук которого обезопашены (другие) мусульмане :",
        "text":  """10 — Нам рассказал Адам ибн Абу Ияас, сказавший: Нам рассказал Шу‘ба, от ‘Абдуллаха ибн Абу ас-Сафара и Исма‘иля ибн Абу Халида от Аш-Ша‘би, от ‘Абдуллаха ибн ‘Амра, да будет доволен Аллах ими обоими, что Пророк ﷺ сказал: «Мусульманин — это тот, кто не причиняет (другим) мусульманам вреда своим языком и своими руками, мухаджиром же является тот, кто прекратил (совершать) запрещённое Аллахом».
        """
    },
    {
        "title": "5. Глава: Чей Ислам является наилучшим?",
        "text": """11 — Нам рассказал Са‘ид ибн Яхья ибн Са‘ид аль-Кураший, сказавший: Нам рассказал мой отец, сказавший: Нам рассказал Абу Бурда ибн ‘Абдулла ибн Абу Бурда от Абу Бурды, от Абу Мусы, да будет доволен им Аллах, что он сказал: «(Однажды люди) спросили: “О Посланник Аллаха, чей Ислам является наилучшим?” Он ответил: “(Ислам) того, кто не причиняет (другим) мусульманам вреда своим языком и своими руками”».
        """
        
    },
    {
        "title": "6. Глава: О том, что (обычай) угощать (людей) является одним из проявлений Ислама",
        "text": """12 — Нам рассказал ‘Амр ибн Халид, сказавший: Нам рассказал Аль-Лейс, от Язида, от Абу аль-Хайра от ‘Абдуллаха ибн ‘Амра, да будет доволен Аллах ими обоими, о том что: «Один человек спросил Пророка ﷺ: “Какое проявление Ислама является наилучшим?” Он ответил: “(Лучшее состоит в том, чтобы) ты кормил (людей) и приветствовал тех, кого знаешь и кого не знаешь”».
        """
    },
    {
        "title": "7. Глава: О том, что желание своему брату того же, чего желаешь самому себе, часть веры",
        "text": """13 — Нам рассказал Мусаддад, сказавший: Нам рассказал Яхья, от Шу‘бы, от Катады, от Анаса, да будет доволен им Аллах, от Пророка ﷺ о том что он сказал: «Не уверует никто из вас до тех пор, пока не станет желать своему брату (в Исламе) того же, чего желает самому себе»
        """
    },
    {
        "title": "8. Глава: Любовь к посланнику ﷺ происходит от веры",

        "text": """14 — Передают со слов Абу Хурайры, да будет доволен им Аллах, что Посланник Аллаха ﷺ сказал: «Клянусь Тем, в Чьей длани душа моя, не уверует никто из вас, пока не станет любить меня больше, чем любит своего отца и своих детей».



15 — Сообщается, что Анас, да будет доволен им Аллах, сказал: «Пророк ﷺ сказал: “Не уверует никто из вас, пока не станет любить меня больше, чем любит своего отца, и своих детей, и всех людей вообще”».
"""
    },
    {
        "title": "9. Глава: Сладость веры",
        "text": """16 — Передают со слов Анаса, да будет доволен им Аллах, что Пророк ﷺ сказал: «Сладость веры ощутит тот, кто отличается тремя (качествами): любит Аллаха и посланника Его больше, чем всё остальное, любит (того или иного) человека только ради Аллаха и не желает возвращаться к неверию так же, как не желает быть ввергнутым в огонь».

"""
    },
    {
        "title": "10. Глава: О том, что любовь к ансарам является признаком веры",
        "text": """17 — Передают со слов Анаса, да будет доволен им Аллах, что Пророк ﷺ сказал: «Признаком веры является любовь к ансарам, а признаком лицемерия — ненависть (по отношению к ним)».
        """  
    },
    {
        "title": "11. Глава",
        "text": """18 — Сообщается, что аз-Зухри сказал:

— Мне сообщил Абу Идрис ‘АизуЛлах ибн ‘Абдуллах о том, что ‘Убада ибн ас-Самит, да будет доволен им Аллах, который участвовал в битве при Бадре и являвшегося одним из старшин в ночь ‘Акъабы, сказал:

«Однажды, когда вокруг Посланника Аллаха ﷺ собралась группа его сподвижников, он сказал им: “Поклянитесь мне в том, что не станете поклоняться наряду с Аллахом ничему, не станете воровать, прелюбодействовать, убивать своих детей, распространять ложь, измышленную вашими сердцами, и отказываться от повиновения(, когда вам будут приказывать совершать) одобряемое (шариатом). Аллах наградит тех из вас, кто будет верен этой клятве, а для того, кто совершит какой-либо из этих (грехов) и будет наказан в мире этом, наказание послужит искуплением. Если же кто-то совершит какой-либо из этих (грехов), а Аллах покроет его (грех), то Аллах и будет решать, и если пожелает, то простит его, а если пожелает, накажет его”».

(‘Убада сказал): «И мы поклялись ему в этом»."""
    },
    {
        "title": "12. Глава: О том, что бегство от искушений является признаком приверженности к религии",
        "text": """19 — Сообщается, что Абу Са‘ид аль-Худри, да будет доволен им Аллах, сказал:

«Посланник Аллаха ﷺ сказал: “Скоро наступит время, когда лучшим имуществом мусульманина окажутся овцы, с которыми он будет скитаться по горным вершинам и тем местам, где выпадают дожди, убегая от искушений со своей религией”».
"""
    },
    {
        "title": "Глава: Слова Пророка ﷺ: «Я знаю об Аллахе больше, чем вы», и о том, что познание — это деяние сердца",
        "text": """Поскольку Всевышний Аллах сказал: «Но призовёт вас к ответу за то, что приобрели ваши сердца» (Сура «аль-Бакъара», 225).



20 — Сообщается, что ‘Аиша, да будет доволен ею Аллах, сказала: «Повелевая им что-либо, Посланник Аллаха ﷺ всегда приказывал делать лишь то, что было (людям) по силам. (Однажды) они сказали: “О Посланник Аллаха, поистине, мы не такие, как ты, ведь Аллах уже простил тебе и прошлые и будущие грехи!” (Услышав это,) он разгневался так, что это стало заметно по его лицу, и воскликнул: “Поистине, я (просто) больше любого из вас боюсь Аллаха и больше любого из вас знаю о Нём!”».
"""
    },
    {
        "title": ". Глава: О том, что тот, кто не желает возвращаться к неверию также, как не желает быть брошенным в огонь, (делает это) из-за веры",
        "text": """21 — Передают со слов Анаса, да будет доволен им Аллах, что Пророк ﷺ сказал: «Сладость веры ощутит тот, кто отличается тремя (качествами): кто любит Аллаха и посланника Его больше, чем всё остальное; кто любит раба (Аллаха) только ради Аллаха; и тот, кто не желает возвращаться к неверию после того, как Аллах спас его, как не желает быть ввергнутым в огонь».
        """
    },
    {
            "title": "15. Глава: Превосходство верующих друг над другом их делами",
            "text": """22 — Передают со слов Абу Са‘ида аль-Худри, да будет доволен им Аллах, что Пророк ﷺ сказал: «(После того как) обитатели Рая войдут в Рай, а обитатели Огня отправятся в Огонь, Аллах Всевышний скажет: “Выведите тех, у кого в сердце было веры хоть на вес горчичного зерна”, и их выведут оттуда почерневшими, а потом бросят в реку(, которая образуется из-за) дождя (или: в реку жизни; это место внушало сомнения Малику), и они станут расти подобно тому, как прорастает семя, оказавшееся близ берега потока. Разве не видел ты, как появляются (из-под земли) жёлтые и искривленные (ростки)?»



23 — Передают со слов Абу Умамы ибн Сахля о том, что он слышал, как Абу Са‘ид аль-Худри, да будет доволен им Аллах, говорил: «(Однажды) Посланник Аллаха ﷺ сказал: “Мне были показаны во сне люди, одетые в рубахи. Некоторые из них доходили (только) до сосков, а иные были ещё короче. И был мне показан ‘Умар ибн аль-Хаттаб, на котором рубаха была (такой) длинной, что волочилась за ним (по земле)”. Люди спросили: “И как же ты истолковал это, о Посланник Аллаха?” Он ответил: “Это- религия”».
"""
        
    },
    {
        "title": "16. Глава: Стыдливость − от веры",
        "text": """24 — Передают со слов Салима ибн ‘Абдуллаха, передавшего со слов своего отца (Ибн ‘Умара, да будет доволен Аллах ими обоими.) о том, что (как-то раз), проходя мимо одного из ансаров, который давал своему брату наставления относительно стыдливости, Посланник Аллаха ﷺ сказал ему: «Оставь его, ибо, поистине, стыдливость — от веры!»
        """
    },
    
    {
        "title": "17. Глава: «А если они покаются, и будут молиться, и станут давать закят, то не становитесь у них на пути…» (“ат-Тауба”, 5)",
        "text": """25 — Передают со слов Ибн ‘Умара, да будет доволен Аллах ими обоими, что Посланник Аллаха ﷺ сказал: «Мне было велено сражаться с (этими) людьми до тех пор, пока они не засвидетельствуют, что нет бога достойного поклонения, кроме Аллаха, и что Мухаммад — Посланник Аллаха, и не станут совершать молитвы и выплачивать закят, а если они будут делать всё это, то защитят от меня свою кровь и своё имущество (, которых впредь их могут лишить не иначе как) по праву Ислама, и (тогда) отчёта с них (вправе будет требовать только) Аллах
        """
    },
    {
        "title":"18. Глава: О том, кто сказал: «Поистине, вера есть действие»",
        "text": """Аллах Всевышний сказал: «Этот Рай дан вам в наследство за то, что вы совершали» (Сура «аз-Зухруф», аят 72).

Некоторые учёные о словах Всевышнего «Клянусь твоим Господом! Мы непременно всех их спросим о том, что они совершали» (Сура «аль-Хиджр», аяты 92-93) сказали, что речь идёт о словах «Нет бога достойного поклонения, кроме Аллаха (Ля иляха илля-ллах)».

Аллах Всевышний также сказал: «Ради такого пусть трудятся труженики!» (Сура «ас-Саффат», аят 61).



26 — Передают со слов Абу Хурайры, да будет доволен им Аллах, что однажды Посланника Аллаха ﷺ спросили: «Какое дело является наилучшим?» Он ответил: «Вера в Аллаха и Его посланника». Его спросили: «А после этого?» Он ответил: «Борьба на пути Аллаха». Его снова спросили: «А после этого?» Он ответил: «Безупречный хадж»."""
    },
    {
        "title": "19. Глава: Если ислам того, кто его принял, не является истинным, и принял его из-за страха перед смертью",
        "text": """Аллах Всевышний сказал: «Бедуины сказали: «Мы уверовали». Скажи: «Вы не уверовали. Посему говорите: “Мы стали мусульманами”» (Сура «аль-Худжурат», 14).

А если человек находится на истинном пути, то он должен соответствовать Его, да будет возвышено Его поминание, словам: «Воистину, религией у Аллаха является ислам» (Сура «Али ‘Имран», 19), а также: «От того, кто ищет иную религию помимо ислама, это никогда не будет принято» (Сура «Али ‘Имран», 85).



27 — Сообщается, что Са‘д ибн Аби Ваккас, да будет доволен им Аллах, сказал: «Однажды Посланник Аллаха ﷺ оделил подарками группу людей, среди которых сидел и я. При этом Посланник Аллаха ﷺ ничего не дал одному человеку, который нравился мне больше всех из них, и я спросил: “О Посланник Аллаха, почему ты так отнёсся к такому-то? Клянусь Аллахом, я считаю, что он — верующий!” Он сказал: “Или мусульманин”. Я помолчал немного, но мне не давало покоя то, что я знал об этом человеке, и я снова спросил: “Почему ты так отнёсся к такому-то? Клянусь Аллахом, я считаю, что он — верующий!” Он сказал: “Или мусульманин”. Но и после этого то, что мне было известно об этом человеке, продолжало беспокоить меня, и я снова задал тот же вопрос. В ответ Посланник Аллаха ﷺ сказал то же самое, а потом добавил: “О Са‘д, поистине, (иногда) я даю человеку что-то, опасаясь, что Аллах ввергнет его лицом в Огонь, хотя другого люблю больше, чем его”».
"""
    },
    {
        "title": "20. Глава: Распространение приветствий /салям/ является частью Ислама",
        "text": """‘Аммар (ибн Йасир) сказал: «Кто объединил в себе три (качества, в том) сочетается полноценная вера: справедливость, распространение приветствий/салям/ повсюду и расходование средств в пользу неимущих не смотря на бедность».



28 — Сообщается, что ‘Абдуллах ибн ‘Амр, да будет доволен Аллах ими обоими, сказал: «Один человек спросил Посланника Аллаха ﷺ: “Какое проявление Ислама является наилучшим?” Он ответил: “(Лучшее состоит в том, чтобы) ты кормил (людей) и приветствовал тех, кого знаешь и кого не знаешь”».
"""
    },
    
]        
hadis_bukhsari = HADIS[0]["text"]


def get_hadis_titles(limit=None):
    """
    Возвращает итератор пар (hadis_id, title) для хадисов.
    
    Args:
        limit: количество хадисов для возврата (None = все)
    
    Yields:
        tuple: (hadis_id, title) где hadis_id начинается с 1
    """
    for idx, hadis_item in enumerate(HADIS[:limit] if limit else HADIS, start=1):
        yield (idx, hadis_item["title"])


def get_hadis_by_id(hadis_id):
    """
    Возвращает словарь хадиса по его ID.
    
    Args:
        hadis_id: номер хадиса (начинается с 1)
    
    Returns:
        dict: словарь с ключами "title" и "text" или None, если не найден
    """
    if 1 <= hadis_id <= len(HADIS):
        return HADIS[hadis_id - 1]
    return None
